app/Controllers/Artikel.php

SELECT `artikel`.`id`, `artikel`.`title`, `artikel`.`slug`, `artikel`.`id_kategori`, `kategori_artikel`.`name` AS `kategori`, `artikel`.`published_at`, `artikel`.`created_at`, `artikel`.`thumbnail`, `artikel`.`content`
FROM `artikel`
JOIN `kategori_artikel` ON `kategori_artikel`.`id` = `artikel`.`id_kategori`
WHERE `artikel`.`slug` = 'warna-warni-payung-cantik-hiasi-wisata-bonpis-waluran-sukabumi'
---
    public function show($id = null)
    {
        $isAdmin = false;
        $request = \Config\Services::request();

        if ($this->request->getHeader('token')) {
            $authHeader = $request->getHeader('token');
            $token      = ($authHeader != null) ? $authHeader->getValue() : null;
            $result     = TokenUtil::checkToken($token);
            $isAdmin    = (in_array($result['data']['previlege'],['admin'])) ? true : false;
        }

        $orderby = (isset($_GET['orderby']) && $_GET['orderby']=='terbaru')? 'DESC': 'ASC';

        if (isset($_GET['id']) && !isset($_GET['kategori'])) {
            $berita = $this->db->table("artikel")
            ->select("artikel.id,artikel.title,artikel.slug,artikel.id_kategori,kategori_artikel.name AS kategori,artikel.published_at,artikel.created_at,artikel.thumbnail,artikel.content")
            ->join('kategori_artikel', 'kategori_artikel.id = artikel.id_kategori')
            ->where("artikel.id",$_GET['id'])->get()->getFirstRow();
        }
        else if (isset($_GET['slug']) && !isset($_GET['kategori'])) {
            $berita = $this->db->table("artikel")
            ->select("artikel.id,artikel.title,artikel.slug,artikel.id_kategori,kategori_artikel.name AS kategori,artikel.published_at,artikel.created_at,artikel.thumbnail,artikel.content")
            ->join('kategori_artikel', 'kategori_artikel.id = artikel.id_kategori')
            ->where("artikel.slug",$_GET['slug'])->get()->getFirstRow();

SELECT `artikel`.`id`, `artikel`.`title`, `artikel`.`slug`, `kategori_artikel`.`name` AS `kategori`, `artikel`.`published_at`, `artikel`.`created_at`, `artikel`.`thumbnail`
FROM `artikel`
JOIN `kategori_artikel` ON `kategori_artikel`.`id` = `artikel`.`id_kategori`
ORDER BY `artikel`.`created_at` ASC
---
            $berita = $berita->orderBy('artikel.created_at',$orderby)->get()->getResultArray();
        }
        else {
            $berita = $this->db->table("artikel")->select('artikel.id,artikel.title,artikel.slug,kategori_artikel.name AS kategori,artikel.published_at,artikel.created_at,artikel.thumbnail')
            ->join('kategori_artikel', 'kategori_artikel.id = artikel.id_kategori');

SELECT `id`, `id_kategori`
FROM `artikel`
WHERE `slug` = 'edukasi-penuh-manfaat-untuk-segala-usia-di-desa-wisata-hanjeli-di-kampung-waluran-kabuapten-sukabumi'
SELECT `id`
FROM `artikel`
WHERE `id_kategori` = '1'
ORDER BY `id` ASC
 LIMIT 1
SELECT `id`
FROM `artikel`
WHERE `id_kategori` = '1'
ORDER BY `id` DESC
 LIMIT 1
---
    public function relatedArticle(): object
    {
        $this->validation->run($this->request->getGet(),'getRelatedArtikel');
        $errors = $this->validation->getErrors();

        if($errors) {
            $response = [
                'status'   => 400,
                'error'    => true,
                'message'  => $errors['id'],
            ];

            return $this->respond($response,400);
        }

        $slug       = ($this->request->getGet('slug')) ? $this->request->getGet('slug') :'' ;

        $allBerita  = [];
        $target     = $this->db->table('artikel')->select("id,id_kategori")->where("slug",$slug)->get()->getResultArray();
        $id         = $target[0]['id'];
        $idKategori = $target[0]['id_kategori'];

        $firstId   = $this->db->table('artikel')->select('id')->where("id_kategori",$idKategori)->limit(1)->orderBy('id','ASC')->get()->getResultArray()[0]['id'];
        $lastId    = $this->db->table('artikel')->select('id')->where("id_kategori",$idKategori)->limit(1)->orderBy('id','DESC')->get()->getResultArray()[0]['id'];