app/Controllers/Home.php

    public function blogList()
    {
        $artikelModel = new ArtikelModel();
        $dataArtikel  = $artikelModel->where("published_at <=",(int)time())->paginate(6,'artikel');
---
SELECT *
FROM `artikel`
WHERE `published_at` <= 1674744734
 LIMIT 6, 6
SELECT COUNT(*) AS `numrows`
FROM `artikel`
WHERE `published_at` <= 1674744734