app/Controllers/Users.php

    public function getProfile()
    {
        global $g_user_id;

        $dbresult = (array)$this->db->table("users")
        ->select("users.id,username")
        ->getWhere(["users.id"=>$g_user_id])
        ->getFirstRow();
---
SELECT `users`.`id`, `username`
FROM `users`
WHERE `users`.`id` = '63c129261bd1d'